/**
 * Created by admin on 2017/3/30.
 */
var cityMap = {//echart从省下钻到市，使用的json文件名的前缀
    "兰州市": "620100",
    "嘉峪关市": "620200",
    "金昌市": "620300",
    "白银市": "620400",
    "天水市": "620500",
    "武威市": "620600",
    "张掖市": "620700",
    "平凉市": "620800",
    "酒泉市": "620900",
    "庆阳市": "621000",
    "定西市": "621100",
    "陇南市": "621200",
    "临夏州": "622900",
    "甘南州": "623000"
};

var province_id = {
    '甘肃省':   '999'
}
var city_ids = {//重点指标查询时使用
    '兰州':		'931',
    '天水':		'938',
    '白银':		'943',
    '酒泉':		'937',
    '张掖':		'936',
    '武威':		'935',
    '金昌':		'945',
    '嘉峪关':	'947',
    '定西':		'932',
    '平凉':		'933',
    '庆阳':		'934',
    '陇南':		'939',
    '临夏':		'930',
    '甘南':		'941'
};

var province_name = "甘肃省";
//百度地图的时候使用，地市名称位置
var latn_center_point = {
    '甘肃省':[101.302437, 37.796718],
    '兰州市':[103.558405, 36.396717],
    '天水市': [105.683293, 34.644548],
    '白银市': [104.653045, 36.552735],
    '酒泉市': [96.422554, 40.3525],
    '张掖市': [99.780061, 38.861879],
    '武威市': [103.208857, 38.175313],
    '金昌市': [102.040629, 38.476046],
    '嘉峪关市': [98.146151, 39.84386],
    '定西市': [104.41388, 35.091873],
    '平凉市': [106.731939, 35.310843],
    '庆阳市': [107.605811, 36.188202],
    '陇南市': [105.324546, 33.642599],
    '临夏州': [103.291645, 35.656951],
    '甘南州': [102.822514, 34.21006]
};
//百度地图使用，区县名称位置
var area_name_point_lng_lat = {
    //兰州
    '城关区':		[103.849312,36.102398],
    '七里河区':		[103.725131,36.001552],
    '安宁区':		[103.649242,36.162097],
    '红古区':		[103.04673,36.298114],
    '西固区':		[103.442272,36.17888],
    '皋兰县':		[103.840114,36.344641],
    '榆中县':		[104.13677,35.95108],
    '永登县':		[103.193909,36.662128],
    //天水
    "甘谷县":[105.247507,34.845769],
    "武山县":[104.833568, 34.716741],
    "甘肃省张家川回族自治县":[106.165072, 35.023796],
    "麦积区":[106.142076, 34.416154],
    "秦州区":[105.587857, 34.406624],
    "秦安县":[105.661446, 34.936725],
    "清水县":[106.096082, 34.766099],
    //白银
    "白银区":[104.152868, 36.573142],
    "会宁县":[105.008343, 36.023974],
    "景泰县":[103.975795, 37.173629],
    "靖远县":[104.679491, 36.571287, 104.640397, 37.112874],
    "平川区":[104.937053, 36.725099],
    //酒泉市
    "敦煌市":[93.948118, 40.289129],
    "甘肃省肃北蒙古族自治县":[95.755652, 39.452738,96.073006, 41.741777],
    "瓜州县":[95.672864, 40.745455],
    "金塔县":[98.952183, 40.377127],
    "玉门市":[97.411409, 40.275039],
    "肃州区":[98.460055, 39.71255],
    "甘肃省阿克塞哈萨克族自治县":[93.787142, 39.109574],
    //张掖市
    "山丹县":[101.14606, 38.613311],
    "甘肃省肃南裕固族自治县":[99.471906, 38.833104,98.947583, 39.659244,101.288639, 37.975341],
    "民乐县":[100.676929, 38.573603],
    "临泽县":[100.115812, 39.41707],
    "甘州区":[100.423966, 38.966089],
    "高台县":[99.632883, 39.541825],
    //武威市
    "古浪县":[103.252551, 37.537124],
    "甘肃省天祝藏族自治县":[102.78342, 37.192029],
    "凉州区":[102.696032, 37.917062],
    "民勤县":[103.05018, 38.757514],
    //金昌市
    "金川区":[102.133765, 38.674634],
    "永昌县":[101.947492, 38.276907],
    //嘉峪关市
    "嘉峪关市":[98.159949, 39.827904],
    //定西市
    "岷县":[104.249454, 34.465692],
    "安定区":[104.612801, 35.632547],
    "通渭县":[105.169319, 35.225968],
    "临洮县":[103.971195, 35.534856],
    "陇西县":[104.596703, 35.12778],
    "渭源县":[104.079279, 35.141004],
    "漳县":[104.341441, 34.743321],
    //平凉市
    "庄浪县":[106.054689, 35.265588],
    "静宁县":[105.652248, 35.450219],
    "灵台县":[107.390792, 35.084311],
    "泾川县":[107.40459, 35.36926],
    "华亭县":[106.58821, 35.220307],
    "崇信县":[106.969954, 35.303302],
    "崆峒区":[106.696294, 35.534856],
    //庆阳市
    "合水县":[108.303758, 36.029579],
    "镇原县":[107.151628, 35.765739],
    "庆城县":[107.652954, 36.057594],
    "环县":[107.043544, 36.599107],
    "宁县":[108.016301, 35.544256],
    "正宁县":[108.342853, 35.45022],
    "华池县":[108.036998, 36.433893],
    "西峰区":[107.659853, 35.703861],
    //陇南市
    "徽县":[106.008695, 33.921055],
    "两当县":[106.275456, 33.907633],
    "西和县":[105.3004, 33.955558],
    "武都区":[105.052036, 33.397961],
    "文县":[104.713986, 32.93569],
    "宕昌县":[104.41043, 34.045583],
    "康县":[105.576359, 33.316903],
    "礼县":[104.966949, 34.164192],
    "成县":[105.679844, 33.754091],
    //临夏州
    "临夏市":[103.182411, 35.600623],
    "广河县":[103.548057, 35.491609],
    "永靖县":[103.180111, 36.029578],
    "甘肃省东乡族自治县":[103.382482, 35.692605],
    "康乐县":[103.541158, 35.26936],
    "临夏县":[102.975441, 35.497251],
    "和政县":[103.253701, 35.361725],
    "积石山县":[102.871957, 35.735743],
    //甘南州
    "舟曲县":[104.273601, 33.623362],
    "碌曲县":[102.447669, 34.423778],
    "临潭县":[103.634295, 34.739525],
    "夏河县":[102.466066, 35.072969],
    "合作区":[103.027184, 35.05406],//合作市
    "玛曲县":[101.573797, 33.899963],
    "卓尼县":[103.266349, 34.499972],
    "迭部县":[103.468719, 34.034096]
};

//数字越大放的越大
var latn_zoom_level = {
    '甘肃省': 7,
    '兰州市': 10,
    '天水市': 10,
    '白银市': 10,
    '酒泉市': 8,
    '张掖市': 9,
    '武威市': 9,
    '金昌市': 10,
    '嘉峪关市': 11,
    '定西市': 10,
    '平凉市': 10,
    '庆阳市': 10,
    '陇南市': 10,
    '临夏州': 10,
    '甘南州': 9
};
var province_name_py = "gansu";
var city_name_speical = ['临夏','甘南','临夏州','甘南州'];
var city_name_reverse = {//为百度地图查询名称做转换
    '兰州':'兰州市',
    '天水':'天水市',
    '白银':'白银市',
    '酒泉':'酒泉市',
    '张掖':'张掖市',
    '武威':'武威市',
    '金昌':'金昌市',
    '嘉峪关':'嘉峪关市',
    '定西':'定西市',
    '平凉':'平凉市',
    '庆阳':'庆阳市',
    '陇南':'陇南市',
    '临夏':'临夏回族自治州',
    '甘南':'甘南藏族自治州'
 };

var name_short_array = {
    "甘肃省张家川回族自治县":"张家川回族自治县",//天水
    "甘肃省肃北蒙古族自治县":"肃北蒙古族自治县",//酒泉
    "甘肃省阿克塞哈萨克族自治县":"阿克塞哈萨克族自治县",//酒泉
    "甘肃省肃南裕固族自治县":"肃南裕固族自治县",//张掖
    "甘肃省天祝藏族自治县":"天祝藏族自治县",//武威,两个凉州区
    "甘肃省东乡族自治县":"东乡族自治县",//临夏
    "合作区":"合作市"//甘南
};

var name_short_array_reverse = {
    "张家川回族自治县":"甘肃省张家川回族自治县",//天水
    "肃北蒙古族自治县":"甘肃省肃北蒙古族自治县",//酒泉
    "阿克塞哈萨克族自治县":"甘肃省阿克塞哈萨克族自治县",//酒泉
    "肃南裕固族自治县":"甘肃省肃南裕固族自治县",//张掖
    "天祝藏族自治县":"甘肃省天祝藏族自治县",//武威,两个凉州区
    "东乡族自治县":"甘肃省东乡族自治县",//临夏
    "合作市":"合作区"//甘南
};

var default_show_index = "移动";
var default_flag = 1;
var cityNames = {
    "兰州市": "lanzhou",
    "天水市": "tianshui",
    "白银市": "baiyin",
    "酒泉市": "jiuquan",
    "张掖市": "zhangye",
    "武威市": "wuwei",
    "金昌市": "jinchang",
    "嘉峪关市": "jiayuguan",
    "定西市": "dingxi",
    "平凉市": "pingliang",
    "庆阳市": "qinyang",
    "陇南市": "longnan",
    "临夏州": "linxiashi",
    "甘南州": "gannan",
    '931':"lanzhou",
    '938':"tianshui",
    '943':"baiyin",
    '937':"jiuquan",
    '936':"zhangye",
    '935':"wuwei",
    '945':"jinchang",
    '947':"jiayuguan",
    '932':"dingxi",
    '933':"pingliang",
    '934':"qinyang",
    '939':"longnan",
    '930':"linxiashi",
    '941':"gannan"
};
var city_names_resource = {
    '931':"lanzhou",
    '938':"tianshui",
    '943':"baiyin",
    '937':"jiuquan",
    '936':"zhangye",
    '935':"wuwei",
    '945':"jinchang",
    '947':"jiayuguan",
    '932':"dingxi",
    '933':"pingliang",
    '934':"qingyang",
    '939':"longnna",
    '930':"linxia",
    '941':"gannan"
};
var city_gis_tiled_layerids = {//echart各地市级别下钻区县时，gis服务地址最后的图层
    '酒泉':		'0',
    '定西':		'0',
    '武威':		'0',
    '平凉':		'0',
    '张掖':		'0',
    '嘉峪关':	'0',
    '陇南':		'0',
    '白银':		'0',
    '金昌':		'0',
    '天水':		'0',
    '庆阳':		'0',
    '临夏':		'100',
    '兰州':		'112',
    '甘南':		'0'
};

var map_id_in_gis = {
    '931':1 ,
    '938':2 ,
    '943':3 ,
    '937':4 ,
    '936':5 ,
    '935':6 ,
    '945':7 ,
    '947':8 ,
    '932':9 ,
    '933':10,
    '934':11,
    '939':12,
    '930':13,
    '941':14
};

//颜色类gis color
var sub_mouse_over_color = [255,133,2];//支局鼠标悬浮色框
var grid_mouse_over_color = [255,71,35];//网格鼠标悬浮色框 深绿29,187,0
var sub_fill_color = [70,182,251,1];//支局板块填充色 已用渐变色实现
var sub_line_color = [255,177,73];//[223,203,88];//支局轮廓颜色
//var sub_name_text_color = [0,0,0];//支局名文字颜色
var sub_name_text_color = [36,49,222];//网格名文字颜色
//var grid_name_text_color = [0,0,0];//网格名文字颜色
var grid_name_text_color = [36,49,222];//网格名文字颜色
//var grid_name_text_color = [5,11,251];//网格名文字颜色
var tops_text_color = [255,0,0];//top10文字颜色

var sub_click_has_subs_fill_color = [105, 246, 178, 0.3];//支局下钻时候，支局下有网格，填充支局板块
var sub_click_has_subs_line_color = [224, 150, 59, 0.5];//支局下钻时候，支局下有网格，画支局轮廓
var sub_click_none_subs_fill_color = [0, 51, 198, 0.5];//支局下钻时候，支局下没有网格，填充支局板块
var sub_click_none_subs_line_color = [224, 150, 59, 0.5];//支局下钻时候，支局下没有网格，填充支局板块
var grid_fill_color = [0,51,198,0.3];//网格填充色//[106, 239, 169, 0.5]浅绿色
var grid_line_color = [32,69,63,0.5];//网格轮廓线

var click_line_color_sub = [255,0,0,1];//[121,5,251,0.7];
var click_line_color_grid = [50,50,128,1];//[121,5,251,0.7];

//不同区县下的支局群所使用配色方案
var city_colors = [
    /*[137,225,116,0.6],
     [250,215,121,0.6],
     [180,169,238,0.6],
     [241,183,169,0.6],
     [216,243,164,0.6],
     [176,190,240,0.6],
     [235,230,144,0.6],
     [233,195,204,0.6],
     [159,229,215,0.6]*/
    [32,90,167,0.7],
    [81,31,114,0.7],
    [115,136,193,0.7],
    [130,115,176,0.7],
    [81,31,144,0.7],
    [121,55,139,0.7],
    [176,190,240,0.7],
    [180,169,238,0.7],
    [93,12,123,0.7]
];
//冒泡地图 地市冒泡坐标位置
var geoCoordMap = {
    '兰州市':[103.5901,36.3043],
    '天水市':[105.6445,34.6289],
    '白银市':[104.8645,36.5076],
    '酒泉市':[96.2622,40.4517],
    '张掖市':[99.7998,38.7433],
    '武威市':[103.0188,38.1061],
    '金昌市':[102.074,38.5126],
    '嘉峪关市':[98.1738,39.8035],
    '定西市':[104.5569,35.0848],
    '平凉市':[107.0728,35.321],
    '庆阳市':[107.5342,36.2],
    '陇南市':[105.304,33.5632],
    '临夏州':[103.2715,35.5737],
    '甘南州':[102.9199,34.6893]
};

//直辖市，echart地图下钻特殊处理，gis层支局返回区县时候的特殊处理，嘉峪关的支局直接返回到嘉峪关市，而不是某个区县
var zxs = {
    '嘉峪关市' : 1,
    '嘉峪关' : 1,
    '947' :[98.28700964379297,39.7848151118973]
}

var opacitySpecial = {
		'947'	: 1
}
/*
 东岗分局
 雁滩分局
 金昌路分局
 武都路分局
 大砂坪分局
 */

var city_center_zoom_gis = {
    '兰州市':{lng:103.68377452990939,lat:36.283448919399,zoom:2},//
    '天水市':{lng:105.68222658134425,lat:34.63660709716706,zoom:2},//
    '白银市':{lng:104.58840744857869,lat:36.70113888545103,zoom:2},//
    '酒泉市':{lng:96.59720458426894,lat:40.16285618118279,zoom:1},//
    '张掖市':{lng:99.94985914931559,lat:38.90265857976021,zoom:1},//
    '武威市':{lng:103.04306296797499,lat:38.11868451104631,zoom:1},//
    '金昌市':{lng:102.08308568615294,lat:38.52316692345361,zoom:2},//
    '嘉峪关市':{lng:98.23942042367636,lat:39.818424998604655,zoom:4},//
    '定西市':{lng:104.54285122255448,lat:35.236092651893514,zoom:2},//
    '平凉市':{lng:106.66216426382337,lat:35.300226801424486,zoom:2},//
    '庆阳市':{lng:107.62802976861516,lat:36.1259827343404,zoom:2},//
    '陇南市':{lng:105.24142185427272,lat:33.564268523965886,zoom:2},//
    '临夏州':{lng:103.25646791739254,lat:35.57436660380768,zoom:3},//
    '甘南州':{lng:102.98066544609293,lat:34.43754043444498,zoom:2},//

    '931':{lng:103.68377452990939,lat:36.283448919399,zoom:2},//
    '938':{lng:105.68222658134425,lat:34.63660709716706,zoom:2},//
    '943':{lng:104.58840744857869,lat:36.70113888545103,zoom:2},//
    '937':{lng:96.59720458426894,lat:40.16285618118279,zoom:1},//
    '936':{lng:99.94985914931559,lat:38.90265857976021,zoom:1},//
    '935':{lng:103.04306296797499,lat:38.11868451104631,zoom:1},//
    '945':{lng:102.08308568615294,lat:38.52316692345361,zoom:2},//
    '947':{lng:98.23942042367636,lat:39.818424998604655,zoom:4},//
    '932':{lng:104.54285122255448,lat:35.236092651893514,zoom:2},//
    '933':{lng:106.66216426382337,lat:35.300226801424486,zoom:2},//
    '934':{lng:107.62802976861516,lat:36.1259827343404,zoom:2},//
    '939':{lng:105.24142185427272,lat:33.564268523965886,zoom:2},//
    '930':{lng:103.25646791739254,lat:35.57436660380768,zoom:3},//
    '941':{lng:102.98066544609293,lat:34.43754043444498,zoom:2}//
};

//gis应用地址
//var tiled_address_pre="http://135.149.48.47:6080/arcgis/rest/services/NewMap/";
var tiled_address_pre="http://135.149.48.80:8030/arcgis/rest/services/NewMap/";
var tiled_address_suf="/MapServer";

//通用四级地址（嘉峪关、定西）
//var standard_address_pre="http://135.149.96.47:6080/arcgis/rest/services/gs_up_gis/";
//var standard_address_suf="_addr/MapServer/0";

//var standard_address_pre="http://135.149.48.47:6080/arcgis/rest/services/bonc_gansu/addr_";
//var standard_address_suf="/MapServer/0";

//支局服务
//嘉峪关支局服务
//var new_url_sub_jyg="http://135.149.48.47:6080/arcgis/rest/services/bonc_gansu/JYG_SUB/MapServer";
//定西支局服务
//var new_url_sub_dx="http://135.149.48.47:6080/arcgis/rest/services/bonc_gansu/DX_SUB/MapServer";
//var new_url_sub_dx="http://135.149.48.47:6080/arcgis/rest/services/bonc_gansu/gs_sub_dingxi/MapServer";

//网格服务
//嘉峪关网格服务
//var new_url_grid_jyg="http://135.149.48.47:6080/arcgis/rest/services/bonc_gansu/JYG_GRID/MapServer";
//定西网格服务
//var new_url_grid_dx="http://135.149.48.47:6080/arcgis/rest/services/bonc_gansu/DX_GRID/MapServer";
//var new_url_grid_dx="http://135.149.48.47:6080/arcgis/rest/services/bonc_gansu/gs_grid_dingxi/MapServer";

//支局服务
//兰州 嘉峪关 定西 平凉 天水
//最新服务正式环境 http://135.149.48.83:8030/arcgis/rest/services/BONC_gansu/gs_xxxxxx_local/MapServer
//最新服务测试环境 http://135.149.48.47:6080/arcgis/rest/services/bonc_gansu/gs_xxxxxx_local/MapServer
//2017.09.15 更新为通用地址，通用的支局（图层2），网格（图层1），标准地址（图层0）
var new_url_sub_pre = "http://135.149.48.83:8030/arcgis/rest/services/BONC_gansu/gs_";
var new_url_sub_suf = "_local/MapServer";

//网格服务
////兰州 嘉峪关 定西 平凉 天水
var new_url_grid_pre = "http://135.149.48.83:8030/arcgis/rest/services/BONC_gansu/gs_";
var new_url_grid_suf = "_local/MapServer";

//通用支局网格服务(其他地市缺省使用)
//var new_url_sub_grid="http://135.149.48.47:6080/arcgis/rest/services/EDA/GRID_SUB/MapServer";

var new_url_point = "http://135.149.48.83:8030/arcgis/rest/services/BONC_gansu/channel_point_new_20170609/MapServer";
var gpServerUrl="http://135.149.48.47:6080/arcgis/rest/services/bonc_gansu/ronghetool/GPServer";

//小区服务
var village_url = "http://135.149.48.83:8030/arcgis/rest/services/BONC_gansu/gs_village_all/MapServer";
//http://135.149.48.47:6080/arcgis/rest/services/bonc_gansu/gs_village_all/MapServer
//http://135.149.96.47:6080/arcgis/rest/services/bonc_gis/gs_village_all/MapServer